erin9057-oss/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
uint8_t kReply3333[] = {
    0x31, 0x8e, 0x00, 0x00, 0x00, 0x00, 0x08, 0x80, 0x00, 0x08, 0x80, 0x00,
    0xa0, 0x21, 0x01, 0x00, 0x00, 0x00, 0x03, 0x00, 0x05, 0x01, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x7b,
    0x00};

uint8_t kReply3401[] = {
    0x12, 0x8e, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x08, 0x80, 0x00,
    0x80, 0x22, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

esp_bt_cod_t makeDeviceClass() {
  esp_bt_cod_t cod = {};
  cod.minor = 2;
  cod.major = 5;
  cod.service = 1;
  return cod;
}

esp_bt_cod_t kDeviceClass = makeDeviceClass();

}  // namespace

ClassicBtControllerTransport *ClassicBtControllerTransport::instance_ = nullptr;

void ClassicBtControllerTransport::begin() {
  instance_ = this;
  clearInputs();
  if (!initializeClassicBluetooth()) {
    Serial.println("WARN bt begin failed");
  }
}

bool ClassicBtControllerTransport::initializeNvsAndBaseAddress() {
  esp_err_t err = nvs_flash_init();
  if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
    ESP_ERROR_CHECK(nvs_flash_erase());
    err = nvs_flash_init();
  }

  if (err != ESP_OK) {
    Serial.printf("WARN nvs_init failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  nvs_handle handle;
  err = nvs_open("storage", NVS_READWRITE, &handle);
  if (err != ESP_OK) {
    Serial.printf("WARN nvs_open failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  uint8_t baseMac[6] = {};
  size_t size = sizeof(baseMac);
  err = nvs_get_blob(handle, "mac_addr", baseMac, &size);
  if (err != ESP_OK || size != sizeof(baseMac)) {
    baseMac[0] = 0xD4;
    baseMac[1] = 0xF0;
    baseMac[2] = 0x57;
    for (size_t index = 3; index < sizeof(baseMac); index += 1) {
      baseMac[index] = static_cast<uint8_t>(esp_random() & 0xFF);
    }
    err = nvs_set_blob(handle, "mac_addr", baseMac, sizeof(baseMac));
    if (err != ESP_OK) {
      nvs_close(handle);
      Serial.printf("WARN nvs_set_blob failed err=%s\n", esp_err_to_name(err));
      return false;
    }
    err = nvs_commit(handle);
    if (err != ESP_OK) {
      nvs_close(handle);
      Serial.printf("WARN nvs_commit failed err=%s\n", esp_err_to_name(err));
      return false;
    }
  }

  nvs_close(handle);

  err = esp_base_mac_addr_set(baseMac);
  if (err != ESP_OK) {
    Serial.printf("WARN base_mac_set failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  Serial.printf(
      "INFO bt base_mac=%02X:%02X:%02X:%02X:%02X:%02X\n",
      baseMac[0],
      baseMac[1],
      baseMac[2],
      baseMac[3],
      baseMac[4],
      baseMac[5]);
  return true;
}

bool ClassicBtControllerTransport::initializeClassicBluetooth() {
  initStep_ = "nvs";
  initError_ = "none";
  if (!initializeNvsAndBaseAddress()) {
    return false;
  }

  initStep_ = "btStart";
  if (!btStarted() && !btStart()) {
    initError_ = "btStart_failed";
    Serial.println("WARN btStart failed");
    return false;
  }
  stackStarted_ = true;

  initStep_ = "bluedroid_init";
  esp_err_t err = esp_bluedroid_init();
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN bluedroid_init failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  initStep_ = "bluedroid_enable";
  err = esp_bluedroid_enable();
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN bluedroid_enable failed err=%s\n", esp_err_to_name(err));
    return false;
  }
  bluedroidReady_ = true;

  initStep_ = "gap_register";
  err = esp_bt_gap_register_callback(
      reinterpret_cast<esp_bt_gap_cb_t>(&ClassicBtControllerTransport::onGapEvent));
  if (err != ESP_OK) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN gap_register failed err=%s\n", esp_err_to_name(err));
    return false;
  }
  gapReady_ = true;

  initStep_ = "set_device_name";
  err = esp_bt_dev_set_device_name(BT_DEVICE_NAME);
  if (err != ESP_OK) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN set_device_name failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  initStep_ = "hid_callback";
  err = esp_bt_hid_device_register_callback(
      reinterpret_cast<esp_hd_cb_t>(&ClassicBtControllerTransport::onHidEvent));
  if (err != ESP_OK) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN hid_register_callback failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  initStep_ = "hid_init";
  err = esp_bt_hid_device_init();
  if (err != ESP_OK) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN hid_init failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  initStep_ = "hid_init_requested";
  initError_ = "ESP_OK";

#if (CONFIG_BT_SSP_ENABLED == true)
  esp_bt_sp_param_t paramType = ESP_BT_SP_IOCAP_MODE;
  esp_bt_io_cap_t ioCap = ESP_BT_IO_CAP_NONE;
  err = esp_bt_gap_set_security_param(paramType, &ioCap, sizeof(ioCap));
  if (err != ESP_OK) {
    Serial.printf("WARN bt set_security_param failed err=%s\n", esp_err_to_name(err));
  }
#endif

  esp_bt_pin_type_t pinType = ESP_BT_PIN_TYPE_VARIABLE;
  esp_bt_pin_code_t pinCode = {};
  err = esp_bt_gap_set_pin(pinType, 0, pinCode);
  if (err != ESP_OK) {
    Serial.printf("WARN bt set_pin failed err=%s\n", esp_err_to_name(err));
  }

  Serial.printf(
      "INFO bt init requested name=\"%s\" provider=\"%s\" desc=\"%s\"\n",
      BT_DEVICE_NAME,
      BT_DEVICE_PROVIDER,
      BT_DEVICE_DESCRIPTION);
  return true;
}

void ClassicBtControllerTransport::clearConnectionState() {
  discoverable_ = false;
  connected_ = false;
  readyForReports_ = false;
  authComplete_ = false;
  pairingComplete_ = false;
  paired_ = false;
  hidReady_ = false;
  appRegistered_ = false;
  gapReady_ = false;
  bluedroidReady_ = false;
  stackStarted_ = false;
  timer_ = 0;
  initStep_ = "idle";
  initError_ = "none";
}

bool ClassicBtControllerTransport::shutdownClassicBluetooth() {
  initStep_ = "shutdown";
  initError_ = "none";
  readyForReports_ = false;

  const esp_err_t scanErr =
      esp_bt_gap_set_scan_mode(ESP_BT_NON_CONNECTABLE, ESP_BT_NON_DISCOVERABLE);
  if (!isIgnorableBluetoothError(scanErr)) {
    Serial.printf("WARN bt shutdown scan_mode err=%s\n", esp_err_to_name(scanErr));
  }

  const esp_err_t unplugErr = esp_bt_hid_device_virtual_cable_unplug();
  if (!isIgnorableBluetoothError(unplugErr)) {
    Serial.printf("WARN bt shutdown vc_unplug err=%s\n", esp_err_to_name(unplugErr));
  }
  delay(200);

  const esp_err_t disconnectErr = esp_bt_hid_device_disconnect();
  if (!isIgnorableBluetoothError(disconnectErr)) {
    Serial.printf("WARN bt shutdown disconnect err=%s\n", esp_err_to_name(disconnectErr));
  }
  delay(200);

  const esp_err_t unregisterErr = esp_bt_hid_device_unregister_app();
  if (!isIgnorableBluetoothError(unregisterErr)) {
    Serial.printf("WARN bt shutdown unregister_app err=%s\n", esp_err_to_name(unregisterErr));
  }
  delay(150);

